<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Aggregating-and-Combining-pandas-DataFrames" data-toc-modified-id="Aggregating-and-Combining-pandas-DataFrames-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Aggregating and Combining <code>pandas</code> DataFrames</a></span><ul class="toc-item"><li><span><a href="#Learning-Goals" data-toc-modified-id="Learning-Goals-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Learning Goals</a></span><ul class="toc-item"><li><span><a href="#Austin-Animal-Center-Data" data-toc-modified-id="Austin-Animal-Center-Data-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>Austin Animal Center Data</a></span></li></ul></li><li><span><a href="#Aggregating-over-DataFrames:-.groupby()" data-toc-modified-id="Aggregating-over-DataFrames:-.groupby()-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Aggregating over DataFrames: <code>.groupby()</code></a></span><ul class="toc-item"><li><span><a href="#.groups-and-.get_group()" data-toc-modified-id=".groups-and-.get_group()-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span><code>.groups</code> and <code>.get_group()</code></a></span><ul class="toc-item"><li><span><a href="#Multi-Indexing" data-toc-modified-id="Multi-Indexing-1.2.1.1"><span class="toc-item-num">1.2.1.1&nbsp;&nbsp;</span>Multi-Indexing</a></span></li></ul></li><li><span><a href="#Aggregating" data-toc-modified-id="Aggregating-1.2.2"><span class="toc-item-num">1.2.2&nbsp;&nbsp;</span>Aggregating</a></span></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-1.2.3"><span class="toc-item-num">1.2.3&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Pivoting-a-DataFrame" data-toc-modified-id="Pivoting-a-DataFrame-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Pivoting a DataFrame</a></span><ul class="toc-item"><li><span><a href="#.pivot_table()" data-toc-modified-id=".pivot_table()-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span><code>.pivot_table()</code></a></span><ul class="toc-item"><li><span><a href="#Example" data-toc-modified-id="Example-1.3.1.1"><span class="toc-item-num">1.3.1.1&nbsp;&nbsp;</span>Example</a></span></li><li><span><a href="#Back-to-Austin-animals" data-toc-modified-id="Back-to-Austin-animals-1.3.1.2"><span class="toc-item-num">1.3.1.2&nbsp;&nbsp;</span>Back to Austin animals</a></span></li></ul></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Methods-for-Combining-DataFrames:-.join(),-.merge(),-pd.concat()" data-toc-modified-id="Methods-for-Combining-DataFrames:-.join(),-.merge(),-pd.concat()-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Methods for Combining DataFrames: <code>.join()</code>, <code>.merge()</code>, <code>pd.concat()</code></a></span><ul class="toc-item"><li><span><a href="#.join()" data-toc-modified-id=".join()-1.4.1"><span class="toc-item-num">1.4.1&nbsp;&nbsp;</span><code>.join()</code></a></span></li><li><span><a href="#.merge()" data-toc-modified-id=".merge()-1.4.2"><span class="toc-item-num">1.4.2&nbsp;&nbsp;</span><code>.merge()</code></a></span></li><li><span><a href="#The-how-Parameter" data-toc-modified-id="The-how-Parameter-1.4.3"><span class="toc-item-num">1.4.3&nbsp;&nbsp;</span>The <code>how</code> Parameter</a></span></li><li><span><a href="#pd.concat()" data-toc-modified-id="pd.concat()-1.4.4"><span class="toc-item-num">1.4.4&nbsp;&nbsp;</span><code>pd.concat()</code></a></span></li><li><span><a href="#EXTRA" data-toc-modified-id="EXTRA-1.4.5"><span class="toc-item-num">1.4.5&nbsp;&nbsp;</span>EXTRA</a></span></li></ul></li><li><span><a href="#King-County-Assessments" data-toc-modified-id="King-County-Assessments-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>King County Assessments</a></span><ul class="toc-item"><li><span><a href="#First,-get-the-data!" data-toc-modified-id="First,-get-the-data!-1.5.1"><span class="toc-item-num">1.5.1&nbsp;&nbsp;</span>First, get the data!</a></span></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-1.5.2"><span class="toc-item-num">1.5.2&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Time-Permitting:-Data-Cleaning-with-Pandas" data-toc-modified-id="Time-Permitting:-Data-Cleaning-with-Pandas-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>Time Permitting: Data Cleaning with Pandas</a></span><ul class="toc-item"><li><span><a href="#1.-Investigate-and-drop-rows-with-invalid-values-in-the-SalePrice-and-SqFtTotLiving-columns." data-toc-modified-id="1.-Investigate-and-drop-rows-with-invalid-values-in-the-SalePrice-and-SqFtTotLiving-columns.-1.6.1"><span class="toc-item-num">1.6.1&nbsp;&nbsp;</span>1. Investigate and drop rows with invalid values in the SalePrice and SqFtTotLiving columns.</a></span></li><li><span><a href="#2.-Investigate-and-handle-non-numeric-ZipCode-values" data-toc-modified-id="2.-Investigate-and-handle-non-numeric-ZipCode-values-1.6.2"><span class="toc-item-num">1.6.2&nbsp;&nbsp;</span>2. Investigate and handle non-numeric ZipCode values</a></span></li><li><span><a href="#3.-Add-a-column-for-PricePerSqFt" data-toc-modified-id="3.-Add-a-column-for-PricePerSqFt-1.6.3"><span class="toc-item-num">1.6.3&nbsp;&nbsp;</span>3. Add a column for PricePerSqFt</a></span></li><li><span><a href="#4.-Subset-the-data-to-2021-sales-only." data-toc-modified-id="4.-Subset-the-data-to-2021-sales-only.-1.6.4"><span class="toc-item-num">1.6.4&nbsp;&nbsp;</span>4. Subset the data to 2021 sales only.</a></span></li><li><span><a href="#5.-What-is-the-mean-price-per-square-foot-for-a-house-sold-in-Seattle-in-2021?" data-toc-modified-id="5.-What-is-the-mean-price-per-square-foot-for-a-house-sold-in-Seattle-in-2021?-1.6.5"><span class="toc-item-num">1.6.5&nbsp;&nbsp;</span>5. What is the mean price per square foot for a house sold in Seattle in 2021?</a></span></li></ul></li><li><span><a href="#Level-Up:-pandas.set_option()" data-toc-modified-id="Level-Up:-pandas.set_option()-1.7"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>Level Up: <code>pandas.set_option()</code></a></span><ul class="toc-item"><li><span><a href="#Block-Scientific-Notation" data-toc-modified-id="Block-Scientific-Notation-1.7.1"><span class="toc-item-num">1.7.1&nbsp;&nbsp;</span>Block Scientific Notation</a></span></li><li><span><a href="#See-More-Rows" data-toc-modified-id="See-More-Rows-1.7.2"><span class="toc-item-num">1.7.2&nbsp;&nbsp;</span>See More Rows</a></span></li></ul></li></ul></li></ul></div>

# Aggregating and Combining `pandas` DataFrames

In [41]:
import pandas as pd
import numpy as np
import requests as rq
from sklearn.preprocessing import OneHotEncoder
from zipfile import ZipFile

## Learning Goals

- Use GroupBy objects to organize and aggregate data
- Create pivot tables from DataFrames
- Combine DataFrames by merging and appending

We'll work with the Austin Animal Center dataset and with data from King County's Department of Assessments (Seattle housing data).

### Austin Animal Center Data

In [42]:
data = rq.get('https://data.austintexas.gov/resource/9t4d-g238.json').text

In [43]:
animals = pd.read_json(data)

In [44]:
animals.head()

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,outcome_subtype
0,A794011,Chunk,2019-05-08 18:20:00,2019-05-08T18:20:00.000,2017-05-02T00:00:00.000,Rto-Adopt,Cat,Neutered Male,2 years,Domestic Shorthair Mix,Brown Tabby/White,NaN
1,A776359,Gizmo,2018-07-18 16:02:00,2018-07-18T16:02:00.000,2017-07-12T00:00:00.000,Adoption,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown,NaN
2,A821648,NaN,2020-08-16 11:38:00,2020-08-16T11:38:00.000,2019-08-16T00:00:00.000,Euthanasia,Other,Unknown,1 year,Raccoon,Gray,NaN
3,A720371,Moose,2016-02-13 17:59:00,2016-02-13T17:59:00.000,2015-10-08T00:00:00.000,Adoption,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff,NaN
4,A674754,NaN,2014-03-18 11:47:00,2014-03-18T11:47:00.000,2014-03-12T00:00:00.000,Transfer,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby,Partner

## Aggregating over DataFrames: `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. (And if you haven't, you'll see it very soon!) Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [45]:
animals.groupby('animal_type')

In [46]:
animals.columns

Index(['animal_id', 'name', 'datetime', 'monthyear', 'date_of_birth',
       'outcome_type', 'animal_type', 'sex_upon_outcome', 'age_upon_outcome',
       'breed', 'color', 'outcome_subtype'],
      dtype='object')

We can group by multiple columns, and also return a DataFrameGroupBy object

Notice the object type [DataFrameGroupBy](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html) object.

### `.groups` and `.get_group()`

In [47]:
animals.groupby(['animal_type', 'outcome_type'])

In [48]:
# This retuns each group indexed by the group name: I.E. 'Bird', along with the row indices of each value
animals.groupby('animal_type').groups

{'Bird': [170, 230, 592], 'Cat': [0, 4, 7, 8, 9, 11, 12, 15, 16, 18, 19, 20, 21, 22, 26, 28, 31, 33, 41, 44, 45, 58, 64, 66, 78, 79, 80, 82, 87, 91, 94, 97, 98, 103, 104, 106, 108, 109, 111, 112, 116, 129, 131, 132, 133, 134, 136, 138, 143, 157, 159, 160, 161, 164, 166, 167, 171, 172, 176, 177, 178, 184, 187, 188, 191, 192, 197, 199, 205, 208, 213, 214, 215, 217, 223, 226, 227, 231, 233, 236, 239, 243, 247, 250, 251, 254, 255, 263, 265, 270, 271, 276, 277, 281, 282, 284, 288, 289, 294, 295, ...], 'Dog': [1, 3, 5, 6, 10, 13, 14, 17, 23, 25, 27, 29, 30, 32, 35, 36, 37, 38, 39, 42, 43, 46, 47, 49, 50, 51, 52, 54, 55, 56, 57, 59, 60, 61, 62, 65, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 81, 85, 86, 88, 90, 92, 93, 95, 96, 99, 100, 101, 102, 105, 107, 110, 113, 114, 115, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 130, 135, 137, 139, 140, 141, 142, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 158, 162, 163, ...], 'Other': [2, 24, 34, 40, 48, 53, 63, 83, 84, 89, 117, 169, 193, 198, 206, 260, 268, 291, 311, 330, 383, 450, 455, 456, 467, 491, 529, 557, 583, 602, 630, 639, 640, 667, 670, 697, 700, 703, 780, 787, 797, 808, 816, 821, 843, 845, 896, 925, 929, 950, 956, 977, 987]}

Once we know we are working with a type of object, it opens up a suite of attributes and methods. One attribute we can look at is groups.

In [49]:
# Once we know the group indices, we can return the groups using those indices.
animals.groupby('animal_type').get_group('Dog')

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,outcome_subtype
1,A776359,Gizmo,2018-07-18 16:02:00,2018-07-18T16:02:00.000,2017-07-12T00:00:00.000,Adoption,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown,NaN
3,A720371,Moose,2016-02-13 17:59:00,2016-02-13T17:59:00.000,2015-10-08T00:00:00.000,Adoption,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff,NaN
5,A659412,Princess,2020-10-05 14:37:00,2020-10-05T14:37:00.000,2013-03-24T00:00:00.000,Adoption,Dog,Spayed Female,7 years,Chihuahua Shorthair Mix,Brown,NaN
6,A814515,Quentin,2020-05-06 07:59:00,2020-05-06T07:59:00.000,2018-03-01T00:00:00.000,Adoption,Dog,Neutered Male,2 years,American Foxhound/Labrador Retriever,White/Brown,Foster
10,A840370,Tulip,2021-08-19 19:36:00,2021-08-19T19:36:00.000,2019-08-06T00:00:00.000,Adoption,Dog,Spayed Female,2 years,Border Collie/Cardigan Welsh Corgi,Black/White,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
993,A689390,Jules,2014-10-08 11:25:00,2014-10-08T11:25:00.000,2013-10-03T00:00:00.000,Transfer,Dog,Intact Female,1 year,Doberman Pinsch Mix,Black/Brown,Partner
994,A811961,Lucas,2020-01-17 16:54:00,2020-01-17T16:54:00.000,2019-03-13T00:00:00.000,Adoption,Dog,Neutered Male,10 months,American Staffordshire Terrier/Labrador Retriever,Fawn/White,NaN
997,A705114,NaN,2015-06-13 15:47:00,2015-06-13T15:47:00.000,2015-06-11T00:00:00.000,Transfer,Dog,Intact Male,2 days,German Shepherd Mix,Brown,Partner
998,A800888,NaN,2019-08-01 15:27:00,2019-08-01T15:27:00.000,2019-07-03T00:00:00.000,Transfer,Dog,Intact Female,4 weeks,Cavalier Span,Black/White,Partner
999,A796517,Chiquis,2019-06-08 12:21:00,2019-06-08T12:21:00.000,2017-06-02T00:00:00.000,Adoption,Dog,Spayed Female,2 years,Chihuahua Shorthair Mix,Brown/White,NaN

How would you get the same dataframe using dataframe slicing?

In [50]:
animals[animals["animal_type"] == "Dog"]

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,outcome_subtype
1,A776359,Gizmo,2018-07-18 16:02:00,2018-07-18T16:02:00.000,2017-07-12T00:00:00.000,Adoption,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown,NaN
3,A720371,Moose,2016-02-13 17:59:00,2016-02-13T17:59:00.000,2015-10-08T00:00:00.000,Adoption,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff,NaN
5,A659412,Princess,2020-10-05 14:37:00,2020-10-05T14:37:00.000,2013-03-24T00:00:00.000,Adoption,Dog,Spayed Female,7 years,Chihuahua Shorthair Mix,Brown,NaN
6,A814515,Quentin,2020-05-06 07:59:00,2020-05-06T07:59:00.000,2018-03-01T00:00:00.000,Adoption,Dog,Neutered Male,2 years,American Foxhound/Labrador Retriever,White/Brown,Foster
10,A840370,Tulip,2021-08-19 19:36:00,2021-08-19T19:36:00.000,2019-08-06T00:00:00.000,Adoption,Dog,Spayed Female,2 years,Border Collie/Cardigan Welsh Corgi,Black/White,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
993,A689390,Jules,2014-10-08 11:25:00,2014-10-08T11:25:00.000,2013-10-03T00:00:00.000,Transfer,Dog,Intact Female,1 year,Doberman Pinsch Mix,Black/Brown,Partner
994,A811961,Lucas,2020-01-17 16:54:00,2020-01-17T16:54:00.000,2019-03-13T00:00:00.000,Adoption,Dog,Neutered Male,10 months,American Staffordshire Terrier/Labrador Retriever,Fawn/White,NaN
997,A705114,NaN,2015-06-13 15:47:00,2015-06-13T15:47:00.000,2015-06-11T00:00:00.000,Transfer,Dog,Intact Male,2 days,German Shepherd Mix,Brown,Partner
998,A800888,NaN,2019-08-01 15:27:00,2019-08-01T15:27:00.000,2019-07-03T00:00:00.000,Transfer,Dog,Intact Female,4 weeks,Cavalier Span,Black/White,Partner
999,A796517,Chiquis,2019-06-08 12:21:00,2019-06-08T12:21:00.000,2017-06-02T00:00:00.000,Adoption,Dog,Spayed Female,2 years,Chihuahua Shorthair Mix,Brown/White,NaN

#### Multi-Indexing

In [51]:
# Same goes for multi index groupbys
animal_outcome = animals.groupby(['animal_type', 'outcome_type'])
animal_outcome.groups

{('Bird', 'Adoption'): [230, 592], ('Bird', 'Died'): [170], ('Cat', 'Adoption'): [7, 8, 9, 20, 21, 26, 33, 44, 64, 66, 79, 82, 94, 97, 98, 103, 106, 111, 112, 116, 136, 157, 160, 161, 166, 171, 172, 176, 178, 184, 187, 199, 205, 208, 213, 214, 215, 217, 223, 226, 227, 231, 233, 247, 251, 254, 255, 271, 277, 284, 288, 294, 295, 296, 300, 302, 304, 310, 313, 316, 319, 322, 326, 329, 332, 341, 351, 356, 360, 362, 364, 365, 366, 369, 371, 373, 397, 405, 407, 416, 418, 421, 424, 441, 444, 447, 457, 462, 463, 465, 471, 475, 485, 498, 504, 506, 509, 516, 518, 519, ...], ('Cat', 'Died'): [58, 323, 492, 526, 741, 762], ('Cat', 'Disposal'): [579, 778], ('Cat', 'Euthanasia'): [19, 28, 41, 133, 134, 191, 250, 312, 340, 379, 419, 428, 497, 584, 634, 638, 770, 886, 937], ('Cat', 'Return to Owner'): [12, 87, 108, 167, 375, 586, 628, 649, 768, 826, 884, 892, 901, 927, 951, 960], ('Cat', 'Rto-Adopt'): [0, 335], ('Cat', 'Transfer'): [4, 11, 15, 16, 18, 22, 31, 45, 78, 80, 91, 104, 109, 129, 131, 132, 138, 143, 159, 164, 177, 188, 192, 197, 236, 239, 243, 263, 265, 270, 276, 281, 282, 289, 305, 309, 337, 352, 355, 361, 390, 402, 404, 406, 409, 410, 414, 415, 422, 426, 427, 430, 433, 442, 453, 460, 468, 484, 495, 499, 507, 512, 513, 528, 536, 541, 548, 552, 554, 560, 563, 568, 569, 577, 580, 581, 604, 610, 615, 618, 619, 624, 635, 644, 646, 652, 656, 668, 669, 672, 678, 681, 682, 684, 689, 696, 699, 704, 705, 709, ...], ('Dog', 'Adoption'): [1, 3, 5, 6, 10, 23, 27, 35, 37, 38, 39, 42, 47, 50, 52, 54, 55, 57, 61, 62, 65, 67, 70, 73, 74, 76, 81, 86, 88, 90, 95, 96, 99, 102, 105, 110, 113, 114, 118, 122, 123, 126, 127, 130, 135, 137, 142, 144, 145, 149, 152, 153, 155, 158, 163, 168, 175, 179, 181, 182, 183, 185, 190, 194, 195, 210, 212, 216, 218, 220, 221, 224, 225, 234, 237, 238, 242, 244, 245, 246, 252, 257, 258, 261, 266, 269, 274, 275, 278, 279, 280, 283, 285, 290, 297, 298, 301, 303, 306, 308, ...], ('Dog', 'Died'): [92, 461, 479, 553, 559], ('Dog', 'Euthanasia'): [156, 174, 481, 486, 617, 621, 955], ('Dog', 'Return to Owner'): [13, 17, 25, 30, 32, 36, 43, 46, 60, 69, 71, 72, 77, 93, 100, 101, 107, 115, 119, 125, 128, 141, 146, 147, 148, 151, 186, 189, 202, 204, 207, 219, 222, 228, 229, 235, 249, 262, 264, 267, 272, 286, 287, 292, 293, 307, 317, 336, 342, 344, 348, 353, 372, 381, 386, 387, 391, 392, 399, 400, 412, 413, 423, 438, 445, 449, 452, 464, 477, 482, 483, 493, 515, 517, 522, 527, 539, 542, 546, 558, 572, 590, 593, 606, 609, 613, 642, 647, 648, 650, 654, 673, 674, 691, 693, 694, 698, 724, 734, 737, ...], ('Dog', 'Rto-Adopt'): [56, 124, 150, 240, 259, 632, 831, 924], ('Dog', 'Transfer'): [14, 29, 49, 51, 59, 68, 75, 85, 120, 121, 139, 140, 154, 162, 165, 173, 180, 196, 200, 201, 203, 209, 211, 232, 241, 248, 253, 256, 273, 299, 315, 318, 327, 328, 339, 345, 347, 354, 359, 376, 377, 389, 395, 401, 408, 417, 420, 425, 434, 435, 446, 448, 454, 459, 470, 473, 480, 494, 505, 523, 524, 534, 535, 544, 550, 551, 561, 570, 582, 587, 595, 597, 601, 611, 620, 625, 655, 662, 663, 665, 701, 716, 722, 725, 738, 746, 747, 752, 759, 764, 766, 774, 775, 776, 789, 796, 798, 802, 819, 832, ...], ('Other', 'Adoption'): [53, 700], ('Other', 'Died'): [268, 291], ('Other', 'Disposal'): [260, 311], ('Other', 'Euthanasia'): [2, 24, 34, 40, 48, 63, 83, 84, 89, 117, 169, 193, 330, 383, 450, 467, 491, 529, 557, 602, 639, 640, 667, 670, 697, 703, 780, 787, 797, 808, 821, 845, 896, 925, 929, 950, 956, 977, 987], ('Other', 'Return to Owner'): [583], ('Other', 'Transfer'): [198, 206, 455, 456, 630, 816, 843]}

In [52]:
# animal_outcome.groups is a dictionary, so we can access the group names using keys()
animal_outcome.groups.keys()

dict_keys([('Bird', 'Adoption'), ('Bird', 'Died'), ('Cat', 'Adoption'), ('Cat', 'Died'), ('Cat', 'Disposal'), ('Cat', 'Euthanasia'), ('Cat', 'Return to Owner'), ('Cat', 'Rto-Adopt'), ('Cat', 'Transfer'), ('Dog', 'Adoption'), ('Dog', 'Died'), ('Dog', 'Euthanasia'), ('Dog', 'Return to Owner'), ('Dog', 'Rto-Adopt'), ('Dog', 'Transfer'), ('Other', 'Adoption'), ('Other', 'Died'), ('Other', 'Disposal'), ('Other', 'Euthanasia'), ('Other', 'Return to Owner'), ('Other', 'Transfer')])

In [53]:
# We can then get a specific group, such as Cats that were adopted
animal_outcome.get_group(('Cat', 'Adoption'))

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,outcome_subtype
7,A860161,*Lalo,2022-07-19 15:53:00,2022-07-19T15:53:00.000,2022-05-04T00:00:00.000,Adoption,Cat,Neutered Male,2 months,Domestic Shorthair,Brown Tabby,NaN
8,A689724,*Donatello,2014-10-18 18:52:00,2014-10-18T18:52:00.000,2014-08-01T00:00:00.000,Adoption,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black,NaN
9,A680969,*Zeus,2014-08-05 16:59:00,2014-08-05T16:59:00.000,2014-06-03T00:00:00.000,Adoption,Cat,Neutered Male,2 months,Domestic Shorthair Mix,White/Orange Tabby,NaN
20,A848454,Olli,2022-01-07 13:02:00,2022-01-07T13:02:00.000,2014-04-20T00:00:00.000,Adoption,Cat,Spayed Female,7 years,Domestic Shorthair Mix,Orange Tabby,NaN
21,A822928,*Primrose,2022-01-24 11:49:00,2022-01-24T11:49:00.000,2010-09-15T00:00:00.000,Adoption,Cat,Spayed Female,11 years,Domestic Shorthair,Torbie,Foster
...,...,...,...,...,...,...,...,...,...,...,...,...
980,A791254,Taco,2019-03-28 13:41:00,2019-03-28T13:41:00.000,2019-02-02T00:00:00.000,Adoption,Cat,Intact Male,1 month,Domestic Shorthair Mix,Blue Tabby/White,NaN
981,A730605,*Kirk,2016-07-11 17:19:00,2016-07-11T17:19:00.000,2016-03-07T00:00:00.000,Adoption,Cat,Neutered Male,4 months,Domestic Shorthair Mix,Black,NaN
986,A820080,*Theodore,2021-08-23 09:47:00,2021-08-23T09:47:00.000,2013-07-11T00:00:00.000,Adoption,Cat,Neutered Male,8 years,Domestic Shorthair,Brown Tabby,Foster
995,A691208,NaN,2014-11-11 18:13:00,2014-11-11T18:13:00.000,2013-12-31T00:00:00.000,Adoption,Cat,Spayed Female,10 months,Domestic Shorthair Mix,Black/White,NaN
996,A718620,*Toby Sue,2016-03-01 13:53:00,2016-03-01T13:53:00.000,2015-07-23T00:00:00.000,Adoption,Cat,Spayed Female,7 months,Domestic Shorthair Mix,Black/White,NaN

### Aggregating

Once again, as we will see in SQL, groupby objects are intended to be used with aggregation. In SQL, we will see that our queries that include GROUP BY require aggregation performed on columns.

We can use `.sum()`, `.mean()`, `.count()`, `.max()`, `.min()`, etc. Find a list of common aggregations [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html).

In [54]:
animals.groupby('animal_type').count()

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,sex_upon_outcome,age_upon_outcome,breed,color,outcome_subtype
animal_type,,,,,,,,,,,
Bird,3,3,3,3,3,3,3,3,3,3,1
Cat,381,229,381,381,381,381,381,381,381,381,229
Dog,563,477,563,563,563,563,563,563,563,563,192
Other,53,8,53,53,53,53,53,53,53,53,44

### Exercise

Use `.groupby()` to find the most recently born of each (main) animal type.

In [55]:
animals.groupby("animal_type")["date_of_birth"].max()

animal_type
Bird     2022-04-18T00:00:00.000
Cat      2023-04-16T00:00:00.000
Dog      2023-03-14T00:00:00.000
Other    2022-12-03T00:00:00.000
Name: date_of_birth, dtype: object

<details>
    <summary>Answer</summary>
    <code>animals.groupby('animal_type')['date_of_birth'].max()</code>
    </details>

## Pivoting a DataFrame

### `.pivot_table()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

Grouping by two different columns can be very helpful.

In [56]:
animals.groupby(by=['outcome_type', 'sex_upon_outcome']).agg(len)

                                  animal_id  name  datetime  monthyear  \
outcome_type    sex_upon_outcome
Adoption        Intact Female             9     9         9          9
                Intact Male              10    10        10         10
                Neutered Male           245   245       245        245
                Spayed Female           217   217       217        217
                Unknown                   1     1         1          1
Died            Intact Female             3     3         3          3
                Intact Male               3     3         3          3
                Neutered Male             1     1         1          1
                Spayed Female             2     2         2          2
                Unknown                   5     5         5          5
Disposal        Intact Male               1     1         1          1
                Unknown                   3     3         3          3
Euthanasia      Intact Female             9     9         9          9
                Intact Male               8     8         8          8
                Neutered Male             4     4         4          4
                Spayed Female             2     2         2          2
                Unknown                  42    42        42         42
Return to Owner Intact Female            18    18        18         18
                Intact Male              33    33        33         33
                Neutered Male            57    57        57         57
                Spayed Female            41    41        41         41
                Unknown                   1     1         1          1
Rto-Adopt       Neutered Male             5     5         5          5
                Spayed Female             5     5         5          5
Transfer        Intact Female            85    85        85         85
                Intact Male              79    79        79         79
                Neutered Male            47    47        47         47
                Spayed Female            38    38        38         38
                Unknown                  26    26        26         26

                                  date_of_birth  animal_type  \
outcome_type    sex_upon_outcome
Adoption        Intact Female                 9            9
                Intact Male                  10           10
                Neutered Male               245          245
                Spayed Female               217          217
                Unknown                       1            1
Died            Intact Female                 3            3
                Intact Male                   3            3
                Neutered Male                 1            1
                Spayed Female                 2            2
                Unknown                       5            5
Disposal        Intact Male                   1            1
                Unknown                       3            3
Euthanasia      Intact Female                 9            9
                Intact Male                   8            8
                Neutered Male                 4            4
                Spayed Female                 2            2
                Unknown                      42           42
Return to Owner Intact Female                18           18
                Intact Male                  33           33
                Neutered Male                57           57
                Spayed Female                41           41
                Unknown                       1            1
Rto-Adopt       Neutered Male                 5            5
                Spayed Female                 5            5
Transfer        Intact Female                85           85
                Intact Male                  79           79
                Neutered Male                47           47
                Spayed Female                38           38
                Unknown                      26           26

                                  age_upon_outcome  breed  color  \
outcome_type    sex_upon_outcome
Adoption        Intact Female                    9      9      9
                Intact Male                     10     10     10
                Neutered Male                  245    245    245
                Spayed Female                  217    217    217
                Unknown                          1      1      1
Died            Intact Female                    3      3      3
                Intact Male                      3      3      3
                Neutered Male                    1      1      1
                Spayed Female                    2      2      2
                Unknown                          5      5      5
Disposal        Intact Male                      1      1      1
                Unknown                          3      3      3
Euthanasia      Intact Female                    9      9      9
                Intact Male                      8      8      8
                Neutered Male                    4      4      4
                Spayed Female                    2      2      2
                Unknown                         42     42     42
Return to Owner Intact Female                   18     18     18
                Intact Male                     33     33     33
                Neutered Male                   57     57     57
                Spayed Female                   41     41     41
                Unknown                          1      1      1
Rto-Adopt       Neutered Male                    5      5      5
                Spayed Female                    5      5      5
Transfer        Intact Female                   85     85     85
                Intact Male                     79     79     79
                Neutered Male                   47     47     47
                Spayed Female                   38     38     38
                Unknown                         26     26     26

                                  outcome_subtype
outcome_type    sex_upon_outcome
Adoption        Intact Female                   9
                Intact Male                    10
                Neutered Male                 245
                Spayed Female                 217
                Unknown                         1
Died            Intact Female                   3
                Intact Male                     3
                Neutered Male                   1
                Spayed Female                   2
                Unknown                         5
Disposal        Intact Male                     1
                Unknown                         3
Euthanasia      Intact Female                   9
                Intact Male                     8
                Neutered Male                   4
                Spayed Female                   2
                Unknown                        42
Return to Owner Intact Female                  18
                Intact Male                    33
                Neutered Male                  57
                Spayed Female                  41
                Unknown                         1
Rto-Adopt       Neutered Male                   5
                Spayed Female                   5
Transfer        Intact Female                  85
                Intact Male                    79
                Neutered Male                  47
                Spayed Female                  38
                Unknown                        26

But it has the unsavory side effect of creating a two-level index. This can be a good time to use `.pivot_table()`.

(There is also a `.pivot()`. For the somewhat subtle differences, see [here](https://stackoverflow.com/questions/30960338/pandas-difference-between-pivot-and-pivot-table-why-is-only-pivot-table-workin).)

#### Example

In [57]:
df = pd.DataFrame({"sex": ["male", "male", "male", "male", "male",
                          "female", "female", "female", "female"],
                    "num_puppies": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "breed": ["terrier", "retriever", "retriever", "terrier",
                          "terrier", "retriever", "terrier", "terrier",
                          "retriever"],
                    "past_owners": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                    "family_members": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

      sex num_puppies      breed  past_owners  family_members
0    male         one    terrier            1               2
1    male         one  retriever            2               4
2    male         one  retriever            2               5
3    male         two    terrier            3               5
4    male         two    terrier            3               6
5  female         one  retriever            4               6
6  female         one    terrier            5               8
7  female         two    terrier            6               9
8  female         two  retriever            7               9

In [58]:
# This first example aggregates values by taking the sum.

table = pd.pivot_table(df, values='past_owners', index=['sex', 'num_puppies'],
                     columns=['breed'], aggfunc=np.sum)
table

breed               retriever  terrier
sex    num_puppies
female one                4.0      5.0
       two                7.0      6.0
male   one                4.0      1.0
       two                NaN      6.0

#### Back to Austin animals

In [59]:
animals.pivot_table(index='outcome_type', columns='sex_upon_outcome', aggfunc=len)

                 age_upon_outcome                                          \
sex_upon_outcome    Intact Female Intact Male Neutered Male Spayed Female
outcome_type
Adoption                      9.0        10.0         245.0         217.0
Died                          3.0         3.0           1.0           2.0
Disposal                      NaN         1.0           NaN           NaN
Euthanasia                    9.0         8.0           4.0           2.0
Return to Owner              18.0        33.0          57.0          41.0
Rto-Adopt                     NaN         NaN           5.0           5.0
Transfer                     85.0        79.0          47.0          38.0

                             animal_id                            \
sex_upon_outcome Unknown Intact Female Intact Male Neutered Male
outcome_type
Adoption             1.0           9.0        10.0         245.0
Died                 5.0           3.0         3.0           1.0
Disposal             3.0           NaN         1.0           NaN
Euthanasia          42.0           9.0         8.0           4.0
Return to Owner      1.0          18.0        33.0          57.0
Rto-Adopt            NaN           NaN         NaN           5.0
Transfer            26.0          85.0        79.0          47.0

                                        ...          name              \
sex_upon_outcome Spayed Female Unknown  ... Intact Female Intact Male
outcome_type                            ...
Adoption                 217.0     1.0  ...           9.0        10.0
Died                       2.0     5.0  ...           3.0         3.0
Disposal                   NaN     3.0  ...           NaN         1.0
Euthanasia                 2.0    42.0  ...           9.0         8.0
Return to Owner           41.0     1.0  ...          18.0        33.0
Rto-Adopt                  5.0     NaN  ...           NaN         NaN
Transfer                  38.0    26.0  ...          85.0        79.0

                                                     outcome_subtype  \
sex_upon_outcome Neutered Male Spayed Female Unknown   Intact Female
outcome_type
Adoption                 245.0         217.0     1.0             9.0
Died                       1.0           2.0     5.0             3.0
Disposal                   NaN           NaN     3.0             NaN
Euthanasia                 4.0           2.0    42.0             9.0
Return to Owner           57.0          41.0     1.0            18.0
Rto-Adopt                  5.0           5.0     NaN             NaN
Transfer                  47.0          38.0    26.0            85.0


sex_upon_outcome Intact Male Neutered Male Spayed Female Unknown
outcome_type
Adoption                10.0         245.0         217.0     1.0
Died                     3.0           1.0           2.0     5.0
Disposal                 1.0           NaN           NaN     3.0
Euthanasia               8.0           4.0           2.0    42.0
Return to Owner         33.0          57.0          41.0     1.0
Rto-Adopt                NaN           5.0           5.0     NaN
Transfer                79.0          47.0          38.0    26.0

[7 rows x 50 columns]

### Exercise

Use `.pivot_table()` to add up the number of my tasks by category. Hint: Use `sum()` as your aggregating function.

In [60]:
tasks = pd.DataFrame({'category': ['house', 'house', 'school', 'school'],
                      'descr': ['kitchen', 'laundry', 'git', 'Python'],
                      'priority': [2, 3, 4, 1], 'num_tasks': [2, 1, 2, 3]})

tasks

  category    descr  priority  num_tasks
0    house  kitchen         2          2
1    house  laundry         3          1
2   school      git         4          2
3   school   Python         1          3

In [61]:
tasks.pivot_table(values='num_tasks',index='category',aggfunc=sum)

          num_tasks
category
house             3
school            5

<details>
    <summary>Answer</summary>
    <code>tasks.pivot_table(values='num_tasks', index='category', aggfunc=sum)</code>
    </details>

## Methods for Combining DataFrames: `.join()`, `.merge()`, `pd.concat()`

### `.join()`

In [62]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns=['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns=['age', 'MP'])

toy1

   age   HP
0   63  142
1   33   47

In [63]:
toy2

   age   MP
0   63  100
1   33  200

In [64]:
# We can't just join these as they are, since we haven't specified our suffixes.

toy1.join(toy2)

ValueError: columns overlap but no suffix specified: Index(['age'], dtype='object')

In [ ]:
toy1.join(toy2, lsuffix='1', rsuffix='2')

   age1   HP  age2   MP
0    63  142    63  100
1    33   47    33  200

If we don't want to keep both, we could set the overlapping column as the index in each DataFrame:

In [ ]:
toy1.set_index('age').join(toy2.set_index('age'))

      HP   MP
age
63   142  100
33    47  200

For more on this method, check out the [doc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html)!

### `.merge()`

Or we could use `.merge()`:

In [ ]:
toy1.merge(toy2)

   age   HP   MP
0   63  142  100
1   33   47  200

In [ ]:
ds_chars = pd.read_csv('data/ds_chars.csv', index_col=0)
ds_chars

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [ ]:
states = pd.read_csv('data/states.csv', index_col=0)
states

  state   nickname     capital
0    WA  evergreen     Olympia
1    TX      alamo      Austin
2    DC   district  Washington
3    OH    buckeye    Columbus
4    OR     beaver       Salem

### The `how` Parameter

This parameter in both `.join()` and `.merge()` tells the compiler what sort of join to effect. We'll cover this in detail when we discuss SQL.

In [ ]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='inner')

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    WA  evergreen     Olympia
2    alan  170         TX    TX      alamo      Austin
3  rachel  200         TX    TX      alamo      Austin
4  alison  300         DC    DC   district  Washington

In [ ]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='outer')

     name     HP home_state state   nickname     capital
0    greg  200.0         WA    WA  evergreen     Olympia
1   miles  200.0         WA    WA  evergreen     Olympia
2    alan  170.0         TX    TX      alamo      Austin
3  rachel  200.0         TX    TX      alamo      Austin
4  alison  300.0         DC    DC   district  Washington
5     NaN    NaN        NaN    OH    buckeye    Columbus
6     NaN    NaN        NaN    OR     beaver       Salem

### `pd.concat()`

This method takes a *list* of pandas objects as arguments.

In [ ]:
ds_full = pd.concat([ds_chars, states])
ds_full

     name     HP home_state state   nickname     capital
0    greg  200.0         WA   NaN        NaN         NaN
1   miles  200.0         WA   NaN        NaN         NaN
2    alan  170.0         TX   NaN        NaN         NaN
3  alison  300.0         DC   NaN        NaN         NaN
4  rachel  200.0         TX   NaN        NaN         NaN
0     NaN    NaN        NaN    WA  evergreen     Olympia
1     NaN    NaN        NaN    TX      alamo      Austin
2     NaN    NaN        NaN    DC   district  Washington
3     NaN    NaN        NaN    OH    buckeye    Columbus
4     NaN    NaN        NaN    OR     beaver       Salem

`pd.concat()`–– and many other pandas operations –– make use of an `axis` parameter. For this particular method I need to specify whether I want to concatenate the DataFrames *row-wise* (`axis=0`) or *column-wise* (`axis=1`). The default is `axis=0`, so let's override that!

In [ ]:
ds_full = pd.concat([ds_chars, states], axis=1)
ds_full

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    TX      alamo      Austin
2    alan  170         TX    DC   district  Washington
3  alison  300         DC    OH    buckeye    Columbus
4  rachel  200         TX    OR     beaver       Salem

### EXTRA

## King County Assessments

As data scientists, we want to build a model to predict the sale price of a house in Seattle in 2019, based on its square footage. We know that the King County Department of Assessments has comprehensive data available on real property sales in the Seattle area. We need to prepare the data.

### First, get the data!

Go [here](https://info.kingcounty.gov/assessor/DataDownload/default.aspx) and download two files: "Real Property Sales" and "Residential Building". Then unzip them. (Or you can run the cells below if you prefer.)

In [ ]:
# %%bash
# cd data
# curl -o property_sales.zip https://aqua.kingcounty.gov/extranet/assessor/Real%20Property%20Sales.zip

In [ ]:
# %%bash
# cd data
# curl -o res_bldg.zip https://aqua.kingcounty.gov/extranet/assessor/Residential%20Building.zip

In [ ]:
# zf = ZipFile('data/property_sales.zip', 'r')
# zf.extractall('data')
# zf.close()

In [ ]:
# zf = ZipFile('data/res_bldg.zip', 'r')
# zf.extractall('data')
# # zf.close()

In [ ]:
# You'll need to use a new encoding here. List of all encodings here:
# https://docs.python.org/3/library/codecs.html#standard-encodings

# Both of these csv files have many columns, so we'll just pre-select
# which ones we want to use.

sales_df = pd.read_csv('data/EXTR_RPSale.csv',
                       encoding='latin-1',
                       usecols=['Major', 'Minor', 'DocumentDate', 'SalePrice'])

In [ ]:
sales_df.info()

In [ ]:
bldg_df = pd.read_csv('data/EXTR_ResBldg.csv',
                     usecols=['Major', 'Minor', 'SqFtTotLiving', 'ZipCode'])

In [ ]:
bldg_df.info()

In [ ]:
sales_data = pd.merge(sales_df, bldg_df, on=['Major', 'Minor'])

In [ ]:
sales_data.head()

In [ ]:
sales_data.info()

We can see right away that we're missing ZIP codes for many of the sales transactions.

In [ ]:
sales_data.loc[sales_data['ZipCode'].isna()].head()

### Exercise

What percentage of housing records are missing ZIP codes?

<details>
    <summary>Answer</summary>
    <code>sales_data['ZipCode'].isna().sum() / sales_data.shape[0]</code>
    </details>

Let's drop the rows with missing zip codes.

In [ ]:
sales_data = sales_data.loc[~sales_data['ZipCode'].isna(), :]
#sales_data2 = sales_data[~sales_data['ZipCode'].isna()]
sales_data

## Time Permitting: Data Cleaning with Pandas

### 1. Investigate and drop rows with invalid values in the SalePrice and SqFtTotLiving columns.

<details>
    <summary>One possible answer here</summary>
    <code>sales_data = sales_data[sales_data['SalePrice'] > 10000]</code>
    </details>

### 2. Investigate and handle non-numeric ZipCode values

Can you find a way to shorten ZIP+4 codes to the first five digits?

In [ ]:
def is_integer(x):
    try:
        _ = int(x)
    except ValueError:
        return False
    return True

sales_data.loc[sales_data['ZipCode'].apply(is_integer) == False, 'ZipCode'].head()

<details>
    <summary>One possible answer here</summary>
    <code>def five_digit_ZIP(x):
    try:
        return int(str(x)[:5])
    except:
        return x
sales_data['ZipCode'] = sales_data['ZipCode'].map(five_digit_ZIP)
sales_data = sales_data.loc[sales_data['ZipCode'].apply(is_integer) == True, :]
sales_data['ZipCode'] = sales_data['ZipCode'].map(int)</code>
    </details>

### 3. Add a column for PricePerSqFt

<details>
    <summary>Answer here</summary>
    <code>sales_data['PricePerSqFt'] = sales_data['SalePrice'] / sales_data['SqFtTotLiving']</code>
    </details>

### 4. Subset the data to 2021 sales only.

We can assume that the DocumentDate is approximately the sale date.

<details>
    <summary>Answer here</summary>
    <code>sales_data['DocumentDate'] = pd.to_datetime(sales_data['DocumentDate'])
sales_data = sales_data.loc[sales_data['DocumentDate'] > '12/31/2020']</code>
    </details>

### 5. What is the mean price per square foot for a house sold in Seattle in 2021?

<details>
    <summary>Answer here</summary>
    <code>sales_data['PricePerSqFt'].mean()</code>
    </details>

## Level Up: `pandas.set_option()`

We can adjust how `pandas` works by setting options in advance.

### Block Scientific Notation

For example, suppose we want to prevent numbers from being displayed in scientific notation.

In [ ]:
df = pd.DataFrame([[1e9, 2e9], [3e9, 4e9]])
df

Then we can use:

In [ ]:
pd.set_option('display.float_format', '{:.2f}'.format)

df

### See More Rows

Or suppose we want `pandas` to show more rows.

In [ ]:
df2 = pd.DataFrame(np.array(range(100)))
df2

In that case we can use:

In [ ]:
pd.set_option('display.max_rows', 100)

df2

For complete documentation, see [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html).